Revit 2024 API
ConnectorElement Class
 A base class that provides support for all connector elements occurring in families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ConnectorElement : Element,
	IConnector
Visual Basic
Public Class ConnectorElement _
	Inherits Element _
	Implements IConnector
Visual C++
public ref class ConnectorElement : public Element,
	IConnector
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ConnectorElement
See Also
ConnectorElement Members
Autodesk.Revit.DB Namespace